# 수치 연산자

# 사직 연산
print(8*3)
print(8+3)
print(8-3)
print(8/3)

print("=" * 35)

# 나누기는 실수로 표현된다.(정수 --> 실수)
print(8/3)
print(8.0/3)
print(8/3.0)
print(8.0/3.0)
print(type(8/2))

print("===================================")

# 몫과 나머지 연산자
print(11//3)    # 몫
print(11%3)     # 나머지
print(8**2)     # 8의 2승
print(divmod(14, 3)) # 몫과 나머지

print("===================================")

# 연산자 우선순위
print(2 + 3 * 4)
print(-2 + 3 * 4)
print(-(2+3) * 4)

print(4 / 2 * 2)
print(4 / (2 * 2))

print(2 ** 3 ** 4)
print(2 ** (3 ** 4))
print((2 ** 3) ** 4)
